
mydata = '''[
  {
    "手机号": 18956600118,
    "描述": "下载成功",
    "主页标题": "订餐123",
    "主页描述": "一、用餐时间前2.5小时停止接受订餐， 用餐时间前2小时停止取消订餐。二、食堂根据当天订餐人数烹饪食材，请需要就餐人
员及时在微信订餐小程序发起订餐，在食堂就餐时扫码核销，如需取消就餐请在上午10：00前取消中餐，下午16：00之前取消晚餐。    三、为进
一步减少浪费，未订餐人员每餐费用上浮2元。",
    "验证码标题": "综合管理部/安全保卫部",
    "验证码描述": "张炎",
    "二级部门": "池州铁塔",
    "三级部门": "综合管理部/安全保卫部",
    "四级部门": "池州铁塔",
    "姓名": "张炎",
    "主菜单name": "食堂订餐",
    "主菜单id": "dingcan",
    "子菜单page_name": "市公司食堂",
    "子菜单page_desc": "订餐",
    "子菜单url": "dingcan"
  },
  {
    "手机号": 18956600118,
    "描述": "下载成功",
    "主页标题": "订餐123",
    "主页描述": "一、用餐时间前2.5小时停止接受订餐， 用餐时间前2小时停止取消订餐。二、食堂根据当天订餐人数烹饪食材，请需要就餐人
员及时在微信订餐小程序发起订餐，在食堂就餐时扫码核销，如需取消就餐请在上午10：00前取消中餐，下午16：00之前取消晚餐。    三、为进
一步减少浪费，未订餐人员每餐费用上浮2元。",
    "验证码标题": "综合管理部/安全保卫部",
    "验证码描述": "张炎",
    "二级部门": "池州铁塔",
    "三级部门": "综合管理部/安全保卫部",
    "四级部门": "池州铁塔",
    "姓名": "张炎",
    "主菜单name": "食堂订餐",
    "主菜单id": "dingcan",
    "子菜单page_name": "市公司食堂",
    "子菜单page_desc": "订单",
    "子菜单url": "ding_dan"
  },
  {
    "手机号": 18956600118,
    "描述": "下载成功",
    "主页标题": "订餐123",
    "主页描述": "一、用餐时间前2.5小时停止接受订餐， 用餐时间前2小时停止取消订餐。二、食堂根据当天订餐人数烹饪食材，请需要就餐人
员及时在微信订餐小程序发起订餐，在食堂就餐时扫码核销，如需取消就餐请在上午10：00前取消中餐，下午16：00之前取消晚餐。    三、为进
一步减少浪费，未订餐人员每餐费用上浮2元。",
    "验证码标题": "综合管理部/安全保卫部",
    "验证码描述": "张炎",
    "二级部门": "池州铁塔",
    "三级部门": "综合管理部/安全保卫部",
    "四级部门": "池州铁塔",
    "姓名": "张炎",
    "主菜单name": "食堂管理",
    "主菜单id": "shi_tang_guan_li",
    "子菜单page_name": "市公司食堂",
    "子菜单page_desc": "晚餐统计",
    "子菜单url": "shi_tang_guan_li_url"
  },
  {
    "手机号": 18956600118,
    "描述": "下载成功",
    "主页标题": "订餐123",
    "主页描述": "一、用餐时间前2.5小时停止接受订餐， 用餐时间前2小时停止取消订餐。二、食堂根据当天订餐人数烹饪食材，请需要就餐人
员及时在微信订餐小程序发起订餐，在食堂就餐时扫码核销，如需取消就餐请在上午10：00前取消中餐，下午16：00之前取消晚餐。    三、为进
一步减少浪费，未订餐人员每餐费用上浮2元。",
    "验证码标题": "综合管理部/安全保卫部",
    "验证码描述": "张炎",
    "二级部门": "池州铁塔",
    "三级部门": "综合管理部/安全保卫部",
    "四级部门": "池州铁塔",
    "姓名": "张炎",
    "主菜单name": "食堂管理",
    "主菜单id": "shi_tang_guan_li",
    "子菜单page_name": "市公司食堂",
    "子菜单page_desc": "中餐统计",
    "子菜单url": "shi_tang_guan_li_url"
  },
  {
    "手机号": 18956600118,
    "描述": "下载成功",
    "主页标题": "订餐123",
    "主页描述": "一、用餐时间前2.5小时停止接受订餐， 用餐时间前2小时停止取消订餐。二、食堂根据当天订餐人数烹饪食材，请需要就餐人
员及时在微信订餐小程序发起订餐，在食堂就餐时扫码核销，如需取消就餐请在上午10：00前取消中餐，下午16：00之前取消晚餐。    三、为进
一步减少浪费，未订餐人员每餐费用上浮2元。",
    "验证码标题": "综合管理部/安全保卫部",
    "验证码描述": "张炎",
    "二级部门": "池州铁塔",
    "三级部门": "综合管理部/安全保卫部",
    "四级部门": "池州铁塔",
    "姓名": "张炎",
    "主菜单name": "食堂订餐",
    "主菜单id": "dingcan",
    "子菜单page_name": "市公司食堂",
    "子菜单page_desc": "评价",
    "子菜单url": "ping_jia"
  },
  {
    "手机号": 18956600118,
    "描述": "下载成功",
    "主页标题": "订餐123",
    "主页描述": "一、用餐时间前2.5小时停止接受订餐， 用餐时间前2小时停止取消订餐。二、食堂根据当天订餐人数烹饪食材，请需要就餐人
员及时在微信订餐小程序发起订餐，在食堂就餐时扫码核销，如需取消就餐请在上午10：00前取消中餐，下午16：00之前取消晚餐。    三、为进
一步减少浪费，未订餐人员每餐费用上浮2元。",
    "验证码标题": "综合管理部/安全保卫部",
    "验证码描述": "张炎",
    "二级部门": "池州铁塔",
    "三级部门": "综合管理部/安全保卫部",
    "四级部门": "池州铁塔",
    "姓名": "张炎",
    "主菜单name": "食堂管理",
    "主菜单id": "shi_tang_guan_li",
    "子菜单page_name": "市公司食堂",
    "子菜单page_desc": "早餐统计",
    "子菜单url": "shi_tang_guan_li_url"
  },
  {
    "手机号": 15305669156,
    "描述": "下载成功",
    "主页标题": "订餐123",
    "主页描述": "一、用餐时间前2.5小时停止接受订餐， 用餐时间前2小时停止取消订餐。二、食堂根据当天订餐人数烹饪食材，请需要就餐人
员及时在微信订餐小程序发起订餐，在食堂就餐时扫码核销，如需取消就餐请在上午10：00前取消中餐，下午16：00之前取消晚餐。    三、为进
一步减少浪费，未订餐人员每餐费用上浮2元。",
    "验证码标题": "综合管理部/安全保卫部",
    "验证码描述": "吴绍兵",
    "二级部门": "池州铁塔",
    "三级部门": "综合管理部/安全保卫部",
    "四级部门": "池州铁塔",
    "姓名": "吴绍兵",
    "主菜单name": "食堂订餐",
    "主菜单id": "dingcan",
    "子菜单page_name": "市公司食堂",
    "子菜单page_desc": "订餐",
    "子菜单url": "dingcan"
  },
  {
    "手机号": 15305669156,
    "描述": "下载成功",
    "主页标题": "订餐123",
    "主页描述": "一、用餐时间前2.5小时停止接受订餐， 用餐时间前2小时停止取消订餐。二、食堂根据当天订餐人数烹饪食材，请需要就餐人
员及时在微信订餐小程序发起订餐，在食堂就餐时扫码核销，如需取消就餐请在上午10：00前取消中餐，下午16：00之前取消晚餐。    三、为进
一步减少浪费，未订餐人员每餐费用上浮2元。",
    "验证码标题": "综合管理部/安全保卫部",
    "验证码描述": "吴绍兵",
    "二级部门": "池州铁塔",
    "三级部门": "综合管理部/安全保卫部",
    "四级部门": "池州铁塔",
    "姓名": "吴绍兵",
    "主菜单name": "食堂订餐",
    "主菜单id": "dingcan",
    "子菜单page_name": "市公司食堂",
    "子菜单page_desc": "订单",
    "子菜单url": "ding_dan"
  },
  {
    "手机号": 15305669156,
    "描述": "下载成功",
    "主页标题": "订餐123",
    "主页描述": "一、用餐时间前2.5小时停止接受订餐， 用餐时间前2小时停止取消订餐。二、食堂根据当天订餐人数烹饪食材，请需要就餐人
员及时在微信订餐小程序发起订餐，在食堂就餐时扫码核销，如需取消就餐请在上午10：00前取消中餐，下午16：00之前取消晚餐。    三、为进
一步减少浪费，未订餐人员每餐费用上浮2元。",
    "验证码标题": "综合管理部/安全保卫部",
    "验证码描述": "吴绍兵",
    "二级部门": "池州铁塔",
    "三级部门": "综合管理部/安全保卫部",
    "四级部门": "池州铁塔",
    "姓名": "吴绍兵",
    "主菜单name": "食堂管理",
    "主菜单id": "shi_tang_guan_li",
    "子菜单page_name": "市公司食堂",
    "子菜单page_desc": "晚餐统计",
    "子菜单url": "shi_tang_guan_li_url"
  },
  {
    "手机号": 15305669156,
    "描述": "下载成功",
    "主页标题": "订餐123",
    "主页描述": "一、用餐时间前2.5小时停止接受订餐， 用餐时间前2小时停止取消订餐。二、食堂根据当天订餐人数烹饪食材，请需要就餐人
员及时在微信订餐小程序发起订餐，在食堂就餐时扫码核销，如需取消就餐请在上午10：00前取消中餐，下午16：00之前取消晚餐。    三、为进
一步减少浪费，未订餐人员每餐费用上浮2元。",
    "验证码标题": "综合管理部/安全保卫部",
    "验证码描述": "吴绍兵",
    "二级部门": "池州铁塔",
    "三级部门": "综合管理部/安全保卫部",
    "四级部门": "池州铁塔",
    "姓名": "吴绍兵",
    "主菜单name": "食堂管理",
    "主菜单id": "shi_tang_guan_li",
    "子菜单page_name": "市公司食堂",
    "子菜单page_desc": "中餐统计",
    "子菜单url": "shi_tang_guan_li_url"
  },
  {
    "手机号": 15305669156,
    "描述": "下载成功",
    "主页标题": "订餐123",
    "主页描述": "一、用餐时间前2.5小时停止接受订餐， 用餐时间前2小时停止取消订餐。二、食堂根据当天订餐人数烹饪食材，请需要就餐人
员及时在微信订餐小程序发起订餐，在食堂就餐时扫码核销，如需取消就餐请在上午10：00前取消中餐，下午16：00之前取消晚餐。    三、为进
一步减少浪费，未订餐人员每餐费用上浮2元。",
    "验证码标题": "综合管理部/安全保卫部",
    "验证码描述": "吴绍兵",
    "二级部门": "池州铁塔",
    "三级部门": "综合管理部/安全保卫部",
    "四级部门": "池州铁塔",
    "姓名": "吴绍兵",
    "主菜单name": "食堂订餐",
    "主菜单id": "dingcan",
    "子菜单page_name": "市公司食堂",
    "子菜单page_desc": "评价",
    "子菜单url": "ping_jia"
  },
  {
    "手机号": 15305669156,
    "描述": "下载成功",
    "主页标题": "订餐123",
    "主页描述": "一、用餐时间前2.5小时停止接受订餐， 用餐时间前2小时停止取消订餐。二、食堂根据当天订餐人数烹饪食材，请需要就餐人
员及时在微信订餐小程序发起订餐，在食堂就餐时扫码核销，如需取消就餐请在上午10：00前取消中餐，下午16：00之前取消晚餐。    三、为进
一步减少浪费，未订餐人员每餐费用上浮2元。",
    "验证码标题": "综合管理部/安全保卫部",
    "验证码描述": "吴绍兵",
    "二级部门": "池州铁塔",
    "三级部门": "综合管理部/安全保卫部",
    "四级部门": "池州铁塔",
    "姓名": "吴绍兵",
    "主菜单name": "食堂管理",
    "主菜单id": "shi_tang_guan_li",
    "子菜单page_name": "市公司食堂",
    "子菜单page_desc": "早餐统计",
    "子菜单url": "shi_tang_guan_li_url"
  }
]'''
flag = '上传'
from mysite import ding_can_mongo as ding_can_mongo #老版订餐后台
import pandas
import time
try:
    df_main = pandas.read_json(mydata,encoding="utf-8", orient='records')
    print(type(df_main['手机号']))
    手机号_list = []
    主菜单id_list = []
    for row_main in df_main.iterrows():
        手机号 = str(row_main[1]['手机号'])
        主菜单id = row_main[1]['主菜单id']
        if 手机号 in 手机号_list:
            pass
        else:
            手机号_list.append(手机号)
        if 主菜单id in 主菜单id_list:
            pass
        else:
            主菜单id_list.append(主菜单id)
    print(手机号_list)
    for 手机号 in 手机号_list:
        主界内容 = []
        df_手机号 = df_main.loc[(df_main['手机号'] == int(手机号))]
        print(df_手机号)
        for row in df_手机号.iterrows():
            创建时间 = time.strftime('%Y-%m-%d %H:%M:%S', time.localtime(time.time()))
            描述 = str(row[1]['描述'])
            主页标题 = str(row[1]['主页标题'])
            主页描述 = str(row[1]['主页描述'])
            验证码标题 = str(row[1]['验证码标题'])
            验证码描述 = str(row[1]['验证码描述'])
            二级部门 = str(row[1]['二级部门'])
            三级部门 = str(row[1]['三级部门'])
            四级部门 = str(row[1]['四级部门'])
            姓名 = str(row[1]['姓名'])
            主菜单name = str(row[1]['主菜单name'])
            主菜单id = str(row[1]['主菜单id'])
            print(主菜单id)
            df_手机号_主菜单name = df_main.loc[(df_main['手机号'] == int(手机号)) & (df_main['主菜单name'] == 主菜单name)]
            pages = []
            for index, row in df_手机号_主菜单name.iterrows():
                子菜单page_name = row['子菜单page_name']
                子菜单page_desc = row['子菜单page_desc']
                子菜单url = row['子菜单url']
                page = {}
                page['url'] = 子菜单url
                page['page_name'] = 子菜单page_name
                page['page_desc'] = 子菜单page_desc
                if page in pages:
                    pass
                else:
                    pages.append(page)
            主菜单id_dict = {
                'id': 主菜单id,
                'name': 主菜单name,
                'open': False,
                'pages': pages
            }
            if 主菜单id_dict in 主界内容:
                pass
            else:
                主界内容.append(主菜单id_dict)
            主界面表_one = ding_can_mongo.订餐主界面表.objects(手机号=str(手机号)).first()
            if 主界面表_one == None:
                ding_can_mongo.订餐主界面表(手机号=str(手机号), 描述=str(描述), 创建时间=str(创建时间), 主页标题=str(主页标题), 主页描述=str(主页描述), 验证码标题=str(验证码标题)
                    , 验证码描述=str(验证码描述),二级部门=二级部门,三级部门=三级部门,四级部门=四级部门,姓名=姓名, 主界内容=主界内容).save()
                print(主界面表_one,二级部门)
            else:
                主界面表_one.update(手机号=str(手机号), 描述=str(描述), 创建时间=str(创建时间), 主页标题=str(主页标题), 主页描述=str(主页描述), 验证码标题=str(验证码标题)
                    , 验证码描述=str(验证码描述),二级部门=二级部门,三级部门=三级部门,四级部门=四级部门,姓名=姓名, 主界内容=主界内容)
                print(主界面表_one,二级部门)
    ding_can_mongo1 = ding_can_mongo.订餐导入时间戳表.objects(flag=flag).first()
    if ding_can_mongo1 == None:
        ding_can_mongo.订餐导入时间戳表(
            flag=flag,
            isOk=True
        ).save()
    else:
        ding_can_mongo1.update(isOk=True)
except:
    import traceback
    r = traceback.format_exc()
    print(r)
    ding_can_mongo1 = ding_can_mongo.订餐导入时间戳表.objects(flag=flag).first()
    if ding_can_mongo1 == None:
        ding_can_mongo.订餐导入时间戳表(
            flag=flag,
            isOk=False,
            eLog={'log':r}
        ).save()
    else:
        ding_can_mongo1.update(isOk=False,eLog={'log':r})